#-*- coding: utf-8 -*-
import sys
import random
from slacker import Slacker

# print (sys.argv[1])
slack_token = 
slack = Slacker(slack_token)

today = sys.argv[1]

koreanFood = ['김치찌개','된장찌개','순두부찌개','참치김치찌개','부대찌개','육개장','갈비탕','참치찌개','뚝배기불고기','해물알탕','순대국','소머리국밥','뼈해장국','설렁탕','고등어조림','갈치조림','꽁치조림','제육덮밥','오징어덮밥','김치덮밥','참치김치덮밥','소고기덮밥','짜장덮밥','낙지덮밥','김치볶음밥','낙지볶음밥','새우볶음밥','소고기볶음밥','오므라이스','카레라이스','비빔밥&돌솥비빔밥','게장백반','알밥','낙지돌솥밥','동태탕','김밥','닭볶음탕','찜닭','보쌈','아구찜','부대찌개','콩나물국밥','돼지국밥','들깨순두부','쫄면','떡볶이&라볶이','치즈떡볶이&라볶이','해물찜','갈비찜','라면','계란라면','치즈라면','김치라면','떡라면','만두라면','떡만두라면','곱창','김치우동','삼겹살(BBQ)','해물우동','김치수제비','파전막걸리','만두국','떡국','칼국수','물냉면','비빔냉면','잔치국수','비빔국수' ]
chinesFood = ['꿔바로우','짜장면','유니짜장','삼선짜장','짬뽕','볶음밥','새우볶음밥','게살볶음밥','쟁반짜장','쟁반짬뽕','냉짬뽕','탕수육','찹쌀탕수육','마라탕','마라항궈','양자피','팔포채','굴짬뽕','잡채밥','유린기','류산슬','크림새우','고추잡채','깐풍기','해물누룽지탕','샥스핀','전가복','샤오롱바오','새우쇼마이','춘권','라조육','사천탕수육','차돌짬뽕','마파두부','자연송이밥','잡탕밥','삼성우동','물만두','군만두','중국냉면','꽃빵','누룽지탕','제비집','칠리새우','북경오리','양꼬치','양갈비','마라룽샤(마라가재같은거)','우육면','딤섬','량피(중국식당면요리)','토마토계란볶음','지삼선','미씨엔','차오미엔(볶음면)','라조육','지파이','궁보기정(닭요리)','완탕면','탄탄면','빠오즈(중국식 찜빵)','동파육','경장육슬','간짜장','교자','어항육슬','토마토계란탕','건두부볶음','라조기']
japaneseFood = ['연어초밥','가라아게','갈비우동','자루우동','미소시루(된장국)','오야코동(닭고기덮밥)','차슈동','우나기동(뱀장어덮밥)','이쿠라동(연어알덮밥)','오차츠케','노리마끼','돈부리','나메로우','몬자야키','낫토','후나즈시','유도후','고야도우후','와규','가츠동','에비가츠동','스테이크동','치즈가츠동','미소가츠동','사케동','에비텐동','규동','에비동','스키야키','모츠나베','부타나베','밀푀유나베','돈가스나베','김치나베','창코나베','야끼소바','온소바','모듬초밥','사시미','오꼬노미야끼','해물오꼬노미야끼','돼지고기 오꼬노미야끼','회덮밥','(냉)모밀국수','(한)모밀국수','(온)모밀국수','오뎅우동','유부우동','튀김우동','장어덮밥','와라비모찌','야끼도리','캘리포니아롤','타코야끼','생선무조림','나가사키짬뽕','참치사시미','도리나베','돈코츠라멘','미소라멘','소유라멘','시오라멘','츠케멘','토이파리탄 라멘','아부라멘(아부라소바)','탄탄멘','모리소바','자루소바','덴세로이소바']
testFood = ['hellow']
goodFood = ['bye']

val = ''

if '한식일식' in today:
	val = random.choice(koreanFood + japaneseFood)
elif '일식한식' in today:
	val = random.choice(japaneseFood + koreanFood)
elif '한식중식' in today:
	val = random.choice(koreanFood + chinesFood)
elif '중식한식' in today:
	val = random.choice(chinesFood + koreanFood)
elif '중식일식' in today:
	val = random.choice(chinesFood + japaneseFood)
elif '일식중식' in today:
	val = random.choice(japaneseFood + chineseFood)
elif '한식' in today:
	val = random.choice(koreanFood)
elif '일식' in today:
	val = random.choice(japaneseFood)
elif '중식' in today:
	val = random.choice(chinesFood)
elif '배고파' in today:
	val = random.choice(testFood)
else:
	allFood = koreanFood + chinesFood + japaneseFood
	val = random.choice(allFood)
print(val)

slack.chat.post_message('#johny_channels', val, as_user=True)
